# -*- coding: utf-8 -*-

from os import getcwd

# プロジェクトファイルまでの絶対パス
BASE_DIR = getcwd()
IMAGE_DIR = BASE_DIR + "/images"
LOG_DIR = BASE_DIR + "/logs"
SRC_DIR = BASE_DIR + "/app"

# 3Dマップの参照先
POS_X = [
    [-1, 0, 1, -1, 0, 1, -1, 0, 1, -1, 0, 1],
    [3, 3, 3, 2, 2, 2, 1, 1, 1, 0, 0, 0],
    [1, 0, -1, 1, 0, -1, 1, 0, -1, 1, 0, -1],
    [-3, -3, -3, -2, -2, -2, -1, -1, -1, 0, 0, 0],
]
POS_Y = [
    [-3, -3, -3, -2, -2, -2, -1, -1, -1, 0, 0, 0],
    [-1, 0, 1, -1, 0, 1, -1, 0, 1, -1, 0, 1],
    [3, 3, 3, 2, 2, 2, 1, 1, 1, 0, 0, 0],
    [1, 0, -1, 1, 0, -1, 1, 0, -1, 1, 0, -1],
]
